//ex16. 다차원배열, 2차원배열
#include <stdio.h>
void main(){ //[몇줄↓][몇칸→] 
	int arr01[2][3] = {90, 80, 70, 85, 95, 75}; //2줄 3칸으로 알아서 나눠짐
	int arr02[2][3] = {{90, 80, 70},{85, 95, 75}}; 
	int arr03[][4] = { //[][]앞에 비우면 가변배열: 빈자리는 0을 넣어서 4칸으로 채워줌 
			{76, 66}, //76, 66, 0, 0으로 4칸 맞춤 
			{80, 70, 60, 50},
			{88, 98, 78, 68}
	};
	//배열의 순회
	int i, j, tot = 0;
	//arr02
	printf("전산\tDB\tPG\t총점\n");
	for(i=0; i<2; i++){ //2줄 {}, {} 2개 
		for(j=0; j<3; j++){ //3칸,  {} 안에 값이 3개니까 
			tot+=arr02[i][j];
			tot++;
		}
	} printf("%d\t%d\t%d\t%d\t", *arr02[0], *arr02[1], *arr02[2], tot);
	
	printf("\n\n");
	
	//arr03
	printf("전산\tDB\tPG\tPT\t총점\n");
	for(i=0; i<3; i++){ //3줄 {}, {}, {} 3개
		for(j=0; j<4; j++){ //4칸, {} 안에 값이 4개니까 
			tot+=arr03[i][j];
		}
	} printf("%d\t%d\t%d\t%d\t%d\n", *arr03[0], *arr03[1], *arr03[2], *arr03[3], tot);
	
	
	
	
}
 
 
